In [1]:
import findspark
findspark.init()

In [2]:
import pyspark
from pyspark.sql import SparkSession

In [3]:
from pyspark.sql.types import StructType, StructField, StringType, IntegerType

In [4]:
# Initialize SparkSession
spark = SparkSession.builder.appName("SparkSQL").getOrCreate()

In [5]:
# Create Scehama for employee DataFrame
employee_schema = StructType([\
    StructField("employee_id", IntegerType(), True),\
    StructField("name", StringType(), True),\
    StructField("age", IntegerType(), True),\
    StructField("department_id", IntegerType(), True),\
    StructField("salary", IntegerType(), True)])

In [6]:
# Create Scehema for department DataFrame
department_schema = StructType([\
    StructField("department_id", IntegerType(), True),\
    StructField("department_name", StringType(), True),\
    StructField("location", StringType(), True)
])

In [7]:
# Sample data for employees
employee_data = [
    (1, "John", 35, 101, 60000),
    (2, "Alice", 28, 102, 55000),
    (3, "Bob", 40, 101, 62000),
    (4, "Mary", 32, 103, 58000),
    (5, "David", 29, 102, 56000),
    (6, "Michael", 45, 101, 65000),
    (7, "Emily", 31, 103, 59000),
    (8, "Daniel", 33, 102, 57000),
    (9, "Sarah", 36, 101, 61000),
    (10, "James", 27, 103, 57000),
    (11, "Emma", 29, 102, 59000),
    (12, "Ryan", 38, 101, 63000),
    (13, "Sophia", 34, 103, 60000),
    (14, "Matthew", 31, 102, 58000),
    (15, "Olivia", 39, 101, 64000),
    (16, "William", 26, 105, 55000),
    (17, "Ava", 30, 102, 60000),
    (18, "Alexander", 37, 101, 62000),
    (19, "Isabella", 32, 103, 57000),
    (20, "Ethan", 28, 105, 56000),
    (21, "Mia", 41, 101, 65000),
    (22, "Michael", 33, 103, 59000),
    (23, "Charlotte", 35, 102, 58000),
    (24, "Daniel", 29, 104, 60000),
    (25, "Sophia", 31, 103, 59000),
    (26, "Lucas", 37, 104, 61000),
    (27, "Amelia", 30, 101, 63000),
    (28, "Benjamin", 39, 103, 60000),
    (29, "Evelyn", 33, 102, 57000),
    (30, "Logan", 28, 105, 59000),
]

In [8]:
# Sample data for departments
department_data = [
    (101, "Engineering", "New York"),
    (102, "Marketing", "Los Angeles"),
    (103, "Finance", "Chicago"),
    (104, "Human Resources", "Houston"),
    (105, "Sales", "San Francisco"),
]

In [9]:
# Create DataFrame
employee_df = spark.createDataFrame(employee_data, employee_schema)
department_df = spark.createDataFrame(department_data, department_schema)

In [10]:
# Register DataFrames as temporary views
employee_df.createOrReplaceTempView("employees")
department_df.createOrReplaceTempView("departments")

## Performing SQL Operations

### 01. Selecting all Employees

In [11]:
all_employees = spark.sql("SELECT * FROM employees")
all_employees.show()

+-----------+---------+---+-------------+------+
|employee_id|     name|age|department_id|salary|
+-----------+---------+---+-------------+------+
|          1|     John| 35|          101| 60000|
|          2|    Alice| 28|          102| 55000|
|          3|      Bob| 40|          101| 62000|
|          4|     Mary| 32|          103| 58000|
|          5|    David| 29|          102| 56000|
|          6|  Michael| 45|          101| 65000|
|          7|    Emily| 31|          103| 59000|
|          8|   Daniel| 33|          102| 57000|
|          9|    Sarah| 36|          101| 61000|
|         10|    James| 27|          103| 57000|
|         11|     Emma| 29|          102| 59000|
|         12|     Ryan| 38|          101| 63000|
|         13|   Sophia| 34|          103| 60000|
|         14|  Matthew| 31|          102| 58000|
|         15|   Olivia| 39|          101| 64000|
|         16|  William| 26|          105| 55000|
|         17|      Ava| 30|          102| 60000|
|         18|Alexander| 37|          101| 62000|
|         19| Isabella| 32|          103| 57000|
|         20|    Ethan| 28|          105| 56000|
+-----------+---------+---+-------------+------+
only showing top 20 rows

### 02. Filter employees by age

In [12]:
senior_employees = spark.sql("SELECT * FROM employees WHERE age>30")
senior_employees.show()

+-----------+---------+---+-------------+------+
|employee_id|     name|age|department_id|salary|
+-----------+---------+---+-------------+------+
|          1|     John| 35|          101| 60000|
|          3|      Bob| 40|          101| 62000|
|          4|     Mary| 32|          103| 58000|
|          6|  Michael| 45|          101| 65000|
|          7|    Emily| 31|          103| 59000|
|          8|   Daniel| 33|          102| 57000|
|          9|    Sarah| 36|          101| 61000|
|         12|     Ryan| 38|          101| 63000|
|         13|   Sophia| 34|          103| 60000|
|         14|  Matthew| 31|          102| 58000|
|         15|   Olivia| 39|          101| 64000|
|         18|Alexander| 37|          101| 62000|
|         19| Isabella| 32|          103| 57000|
|         21|      Mia| 41|          101| 65000|
|         22|  Michael| 33|          103| 59000|
|         23|Charlotte| 35|          102| 58000|
|         25|   Sophia| 31|          103| 59000|
|         26|    Lucas| 37|          104| 61000|
|         28| Benjamin| 39|          103| 60000|
|         29|   Evelyn| 33|          102| 57000|
+-----------+---------+---+-------------+------+

### 03. Group employees by department & calculate average salary

In [14]:
avg_salary_by_department = spark.sql("""
    SELECT department_id, AVG(salary) as avg_salary
    FROM employees
    GROUP BY department_id
""")

avg_salary_by_department.show()

+-------------+------------------+
|department_id|        avg_salary|
+-------------+------------------+
|          101| 62777.77777777778|
|          102|           57500.0|
|          103|           58625.0|
|          105|56666.666666666664|
|          104|           60500.0|
+-------------+------------------+

### 04. Join employees & departments

In [15]:
employee_department_join = spark.sql("""
    SELECT e.*, d.department_name
    FROM employees e
    INNER JOIN departments d
    on e.department_id = d.department_id
""")

employee_department_join.show()

+-----------+---------+---+-------------+------+---------------+
|employee_id|     name|age|department_id|salary|department_name|
+-----------+---------+---+-------------+------+---------------+
|          1|     John| 35|          101| 60000|    Engineering|
|          3|      Bob| 40|          101| 62000|    Engineering|
|          6|  Michael| 45|          101| 65000|    Engineering|
|          9|    Sarah| 36|          101| 61000|    Engineering|
|         12|     Ryan| 38|          101| 63000|    Engineering|
|         15|   Olivia| 39|          101| 64000|    Engineering|
|         18|Alexander| 37|          101| 62000|    Engineering|
|         21|      Mia| 41|          101| 65000|    Engineering|
|         27|   Amelia| 30|          101| 63000|    Engineering|
|          2|    Alice| 28|          102| 55000|      Marketing|
|          5|    David| 29|          102| 56000|      Marketing|
|          8|   Daniel| 33|          102| 57000|      Marketing|
|         11|     Emma| 29|          102| 59000|      Marketing|
|         14|  Matthew| 31|          102| 58000|      Marketing|
|         17|      Ava| 30|          102| 60000|      Marketing|
|         23|Charlotte| 35|          102| 58000|      Marketing|
|         29|   Evelyn| 33|          102| 57000|      Marketing|
|          4|     Mary| 32|          103| 58000|        Finance|
|          7|    Emily| 31|          103| 59000|        Finance|
|         10|    James| 27|          103| 57000|        Finance|
+-----------+---------+---+-------------+------+---------------+
only showing top 20 rows

### 05. Count employees in each department

In [16]:
employee_count_by_department = spark.sql("""
    SELECT department_id, COUNT(*)
    FROM employees
    GROUP BY department_id
""")

employee_count_by_department.show()

+-------------+--------+
|department_id|count(1)|
+-------------+--------+
|          101|       9|
|          102|       8|
|          103|       8|
|          105|       3|
|          104|       2|
+-------------+--------+

### 06. Median

In [21]:
# Calculate the median salary for each department
from pyspark.sql.functions import expr

median_salary_by_department = spark.sql("""
    SELECT e.department_id, d.department_name,
           percentile_approx(salary, 0.5) AS median_salary
    FROM employees e
    INNER JOIN departments d
    ON e.department_id = d.department_id
    GROUP BY e.department_id, d.department_name
""")
median_salary_by_department.show()

+-------------+---------------+-------------+
|department_id|department_name|median_salary|
+-------------+---------------+-------------+
|          101|    Engineering|        63000|
|          102|      Marketing|        57000|
|          103|        Finance|        59000|
|          104|Human Resources|        60000|
|          105|          Sales|        56000|
+-------------+---------------+-------------+

### 07. Highest Salary of Each Department

In [23]:
highest_salary = spark.sql("""
    SELECT e.*, d.department_name,
    MAX(e.salary) OVER (PARTITION BY department_name) AS highest_salary
    FROM employees e
    INNER JOIN departments d
    on e.department_id = d.department_id
""")

highest_salary.show()

+-----------+---------+---+-------------+------+---------------+--------------+
|employee_id|     name|age|department_id|salary|department_name|highest_salary|
+-----------+---------+---+-------------+------+---------------+--------------+
|          1|     John| 35|          101| 60000|    Engineering|         65000|
|          3|      Bob| 40|          101| 62000|    Engineering|         65000|
|          6|  Michael| 45|          101| 65000|    Engineering|         65000|
|          9|    Sarah| 36|          101| 61000|    Engineering|         65000|
|         12|     Ryan| 38|          101| 63000|    Engineering|         65000|
|         15|   Olivia| 39|          101| 64000|    Engineering|         65000|
|         18|Alexander| 37|          101| 62000|    Engineering|         65000|
|         21|      Mia| 41|          101| 65000|    Engineering|         65000|
|         27|   Amelia| 30|          101| 63000|    Engineering|         65000|
|          4|     Mary| 32|          103| 58000|        Finance|         60000|
|          7|    Emily| 31|          103| 59000|        Finance|         60000|
|         10|    James| 27|          103| 57000|        Finance|         60000|
|         13|   Sophia| 34|          103| 60000|        Finance|         60000|
|         19| Isabella| 32|          103| 57000|        Finance|         60000|
|         22|  Michael| 33|          103| 59000|        Finance|         60000|
|         25|   Sophia| 31|          103| 59000|        Finance|         60000|
|         28| Benjamin| 39|          103| 60000|        Finance|         60000|
|         24|   Daniel| 29|          104| 60000|Human Resources|         61000|
|         26|    Lucas| 37|          104| 61000|Human Resources|         61000|
|          2|    Alice| 28|          102| 55000|      Marketing|         60000|
+-----------+---------+---+-------------+------+---------------+--------------+
only showing top 20 rows